#+title: Evaluación de la exposición
#+author: Gunnar Wolf

* Sandbox: Aislamiento de aplicaciones

- Tema presentado por :: Eduardo Antonio Álvarez Salgado y Arumy Lizeth
  Morales Castillo
- Calificación global :: 8.92

|------------------------+------+--------------------+------+---------|
| Evaluación  compañeros | Peso | Evaluación docente | Peso | *Total* |
|------------------------+------+--------------------+------+---------|
|                    9.3 |  0.3 |               8.75 |  0.7 |    8.92 |
|------------------------+------+--------------------+------+---------|
#+TBLFM: @2$5=$1*$2+$3*$4;f-2

* Evaluación grupal

|              | 1 | 2 | 3 | 4 | 5 | Total |
|--------------+---+---+---+---+---+-------|
| Originalidad | 0 | 0 | 0 | 1 | 3 |  9.50 |
| Nivel        | 0 | 0 | 0 | 2 | 2 |  9.00 |
| Relevancia   | 0 | 0 | 0 | 2 | 2 |  9.00 |
| Claridad     | 0 | 0 | 0 | 1 | 3 |  9.50 |
| Presencia    | 0 | 0 | 0 | 1 | 3 |  9.50 |
|--------------+---+---+---+---+---+-------|
|              |   |   |   |   |   |  9.30 |
#+TBLFM: @2$7..@6$7=10 * (0.2*$2 + 0.4*$3 + 0.6*$4 + 0.8*$5 + $6 ) / vsum($2..$6); f-2::@7$7=vmean(@2$7..@6$7); f-2

** Comentarios de los compañeros
- Los compañeros tienen buen dominio del tema que decidieron exponer, al
  igual que el tema me pareció bastante original.
- Ninguno.

* Evaluación por parte del docente

| *Aspecto*              | *Peso* | *Evaluación* | *Puntos* |
|------------------------+--------+--------------+----------|
| Originalidad del tema  |    0.1 |           10 |       1. |
| Material desarrollado  |    0.2 |           10 |       2. |
| Contenido              |    0.2 |          7.5 |      1.5 |
| Fuentes bibliográficas |    0.1 |           10 |       1. |
| Uso del tiempo         |    0.1 |           10 |       1. |
| Dominio del tema       |   0.15 |          7.5 |    1.125 |
| Presencia              |   0.15 |          7.5 |    1.125 |
|------------------------+--------+--------------+----------|
| *Global*               |        |              |     8.75 |
#+TBLFM: @<<$4..@>>$4=$2*$3::$4=vsum(@<<..@>>);f-2

** Comentarios
- Si mencionan (§2.3) ejemplos de “Seguridad por diseño”... SELinux,
  AppArmor y el sandbox de MacOS (desconozco el caso de Android) son todos
  /reactivos/, no /preventivos/: existen en sistemas con largos años de uso
  y con problemas conocidos de seguridad, y estos tres sistemas buscan
  corregir una limitación preexistente.
- La presentación “camina un tanto en círculos”: En §3.3 están volviendo a
  decir lo que ya habían presentado anteriormente, por ejemplo, respecto al
  papel de cgroups y namespaces
- La presentación es buena, pero /el que mucho abarca poco aprieta/:
  Eligieron un tema muy amplio y evaluar el panorama en muchos distintos
  sistemas. Como consecuencia, no entraron en los detalles técnicos
  “jugosos” en ninguno de los sistemas 🙁
- El ritmo al que fueron leyendo se siente a ratos mecánico, pesado.
